BOT_TOKEN = "5380784172:AAFrrA5i7pe6bSDpmncbc2Tk8Gj0rQ9YJjc"

ID_RAFAIL = 429272623

INFO_FOR_BUY_COURSE = "Пользователь {} @{} хочет приобрести курс {}"

START_TEXT = """Добро пожаловать, {}! 👋

Меня зовут <b>Рафаил</b> @rafailvv, я студент <b>Университета Иннополис</b>, одного из самых современных и лучших IT ВУЗов в России!  🔝

✅ Я… 😌
📍владею языками программирования Python, С++, Java 🤓
📍педагог доп. образования Университета Иннополис 👨‍🏫
📍финалист всероссийской олимпиады НТИ🎖
📍более 3-х лет из обычных людей делаю программистов 👨‍💻
📍собрал команду молодых амбициозных преподавателей 👨‍🎓

Мы с командой разработали программу курсов, направленная не просто на изучение сухой теории с решением однотипных задач 😒, а на <u>создание интересных и познавательных проектов</u> 😊

Выберите ниже курс чтобы узнать о нём подробнее 👇🏼
"""

COURSE_TEXT = "❗Ближайший старт курса <u>{}</u> через<b> {} дня </b>❗"

COURSES_LIST = "Выберите ниже курс чтобы узнать о нём подробнее 👇🏼"

BUY_COURSE_TEXT = """❗Ваша заявка на приобритение курса {} <b>зарегистрирована</b>❗

Для получения более подробной информации:
Telegram: @rafailvv
Тел: +7 (939) 395-41-95

С уважением,
Венедиктов Рафаил
"""

REJECTED_TEXT = "К сожалению, ваша заявка на курс {} отклонена "
ACCEPTED_TEXT = "Поздравляем, вы зарегистрированы на курс {}"