ID_RAFAIL = 429272623

START_TEXT = """Добро пожаловать, {}! 👋

Меня зовут <b>Рафаил</b> @rafailvv, я студент <b>Университета Иннополис</b>, одного из самых современных и лучших IT ВУЗов в России!  🔝

✅ Я… 😌
📍владею языками программирования Python, С++, Java 🤓
📍педагог доп. образования Университета Иннополис 👨‍🏫
📍финалист всероссийской олимпиады НТИ🎖
📍более 3-х лет из обычных людей делаю программистов 👨‍💻
📍собрал команду молодых амбициозных преподавателей 👨‍🎓

Мы с командой разработали программу курсов, направленная не просто на изучение сухой теории с решением однотипных задач 😒, а на <u>создание интересных и познавательных проектов</u> 😊

Выберите ниже курс чтобы узнать о нём подробнее 👇🏼
"""

COURSE_TEXT = "❗Ближайший старт курса <u>{}</u> через<b> {} {} </b>❗"

COURSES_LIST = "Выберите ниже курс чтобы узнать о нём подробнее 👇"

BUY_COURSE_TEXT = """❗Ваша заявка на приобритение курса {} <b>зарегистрирована</b>❗

Для получения более подробной информации:
Telegram: @rafailvv
Тел: +7 (939) 395-41-95

С уважением,
Венедиктов Рафаил
"""

INFO_FOR_BUY_COURSE = "Пользователь <b>{}</b> @{} хочет приобрести курс <u>{}</u>"

REJECTED_TEXT = "🥲 К сожалению, ваша заявка на курс {} отклонена "
ACCEPTED_TEXT = "🥳 Поздравляем, вы зарегистрированы на курс {}"

SUCCESSFUL_PAYMENT_TEXT = "🥳 Поздравляем, курс <b>\"{}\"</b> успешно оплачен!"
SUCCESSFUL_PAYMENT_INFO_FOR_ADMIN =  "Пользователь <b>{}</b> @{} оплатил курс <u>\"{}\"</u>"

FLOW_LIST_TEXT = "Выберите нужный поток 👇"

TEACHER_START_TEXT = """👋 Добро пожаловать, {}, в <b>личный кабинет преподавателя</b>!

""" + FLOW_LIST_TEXT

STUDENT_START_TEXT = """👋 Добро пожаловать, {}, в <b>личный кабинет студента</b>!

""" + FLOW_LIST_TEXT

SELECTED_FLOW_TEXT = "Поток <b>{}</b> выбран"

TIMETABLE_TEXT = """📌 <b>Расписание занятий</b>

{}"""

CONNECT_TO_LINK_TEACHER = """❗Давай скорее, ученики уже ждут тебя❗"""

CONNECT_TO_LINK_STUDENT = """❗Преподаватель будет уже совсем скоро, поэтому скроее подключайся❗"""


NOTIFICATION_STUDENT_START_LESSON_TEXT = """😱 Занятие уже начинается, скорее присоединяйся 😱"""

PERSON_INFO_TEXT = """{} <b>{}</b> 

🔑 Ник: {}
📲 Тел: {}"""

CORRECTNESS_PERSONAL_INFO = """🔎 Проверьте корректность введённых данных учащегося 👇👇👇

🔡 ФИО: {}
📲 Тел: {}
🔑 Ник: @{}

📌 Если данные введены корректно, нажмите кнопку <b>Подтвердить</b>, иначне измените некорректные данные"""

